const lenguaje = () => { return 'ar' } //Arabe 

//index.js 
const console = { 
text1: ` طريقة الربط`, 
text2: ` كيف تود الاتصال؟`, 
text3: `⇢  الخيار 1:`, 
text4: ` رمز الاستجابة السريعة`, 
text5: `⇢  الخيار 2:`,  
text6: ` رمز مكون من 8 أرقام.`, 
text7: ` اكتب فقط رقم ال`, 
text8: ` خيار الاتصال.`, 
text9: (chalk) => ` فقط الأرقام مسموح بها ${chalk.bold.greenBright("1")} O ${chalk.bold.greenBright("2")}, لا حروف ولا رموز خاصة.\n${chalk.bold.yellowBright(" نصيحة: نسخ رقم الخيار ولصقه في الوحدة التحكم.")}`, 
text10: `🟢 ابدأ برمز البلد لرقم الواتساب الخاص بك، على سبيل المثال: +59178862672`, 
text11: `🟢 أدخل الرقم الذي سيكون البوت\nعلى سبيل المثال: +59178862672`, 
text12: `❌ تأكد من إضافة رمز البلد.`, 
text13: `👑 رمز الربط 👑:` }

//tmp "archivo basura"
const tmp = () => { return `╭━─━─━─≪🔆≫─━─━─━╮\n│ تم تنظيف مجلد TMP بشكل صحيح\n╰━─━─━─≪🔆≫─━─━─━╯` } 

//detec
const smsAvisos = () => { return `[ 🔒 مجموعة مغلقة ]` }// 
const smsAvisos2 = () => { return `「 إعدادات المجموعة \n\n*الآن يمكن للمسؤولين فقط الكتابة في المجموعة*` }
const smsAvisos3 = () => { return `[ 🔓 مجموعة مفتوحة ]` } 
const smsAvisos4 = () => { return `「 تكوين المجموعة 」\n\n*الآن يرسل جميع المشاركين رسائل 🗣️*` } 
const smsAvisos5 = () => { return `「 تكوين المجموعة 」\n\n` }
const smsAvisos6 = () => { return `*الآن يمكن للمسؤولين فقط تحرير إعدادات المجموعة*` } 
const smsAvisos7 = () => { return ` الآن يمكن لجميع المشاركين تحرير إعدادات المجموعة` }
const smsAvisos8 = () => { return ` تم تغيير وصف المجموعة والوصف الجديد هو:` }
const smsAvisos9 = () => { return ` تم تغيير اسم المجموعة والاسم الجديد هو:` }

//welcome
const smsWel =  () => { return ` مرحبًا` }
const smsWel2 = () => { return ` مرحباً` }
const smsBye = () => { return ` وداعا` }
const promote = () => { return ` الآن أنتم مشرفو المجموعة\n\n> فاعلية يجب أن تنفذ :` }
const demote = () => { return ` توقف عن كونك مشرفًا للمجموعة\n\n> "عمل تم اتخاذه بواسطة : ` }

//mensaje el la consola inicio
const smsConexion = () => { return `🟢 المستخدم يتصل =>` }
const smsEscaneaQR = () => { return ` اسحب الكيو آر، تنتهي خلال 45 ثانية...` }
const smsConectado = () => { return ` أنت متصل بشكل صحيح` }
const smsConexionOFF = () => { return ` [ ⚠️ ] تم إغلاق الاتصال، يرجى حذف مجلد الجلسات ومسح مرة أخرى.`}
const smsConexioncerrar = () => { return `⚠️ انقطاع الاتصال، في محاولة لإعادة الاتصال` }
const smsConexionperdida = () => { return `[⚠️ فقد الاتصال بالخادم ، إعادة الاتصال...`}
const smsConexionreem = () => { return `[ ⚠️ ] تم استبدال الاتصال، تم فتح جلسة جديدة. يرجى إغلاق الجلسة الحالية أولاً.`}
const smsConexionreinicio = () => { return `🔁 إعادة التشغيل مطلوبة، جاري إعادة التشغيل...`}
const smsConexiontiem = () => { return `[ ⚠️ ] انتهت صلاحية وقت الاتصال، جاري إعادة الاتصال...`}
const smsConexiondescon = () => { return `[ ⚠️ ] `}

//call
const smscall = () => { return ` سوف تُحظر*\n_السبب: للقيام ب` }
const smscall2 = () => { return `*إذا اتصلت بالخطأ، يرجى الاتصال بمبتكري لفك حظرك.**` }

//antiprivado
const smsAntiPv = () => { return `*من الغير مسموح التحدث بصورة خاصة مع البوت، سيتم حظرك.**` }

//main.js
const consola = {
text: ` وقت:`, 
text1: ` طريق:`, 
text2: ` النوع (الرسائل القصيرة):`, 
text3: ` مستخدم:`, 
text4: ` مجموعة محادثة:`, 
text5: ` دردشة خاصة:`, 
text6: ` رسالة:` }

//autobio
const Bio = { 
text: `🦁 ɴᴏᴠᴀʙᴏᴛ - ᴛᴇɴɢᴏ:`, 
text2: `ᴜsᴜᴀʀɪᴏs ᴜsᴀᴅᴏʀᴍᴇ ᴘᴜᴇᴅᴏ ʀᴇsᴘᴏɴᴅᴇ ʟᴇɴᴛᴀ ᴍɪ ᴠᴇʟᴏᴄɪᴅᴀᴅ ᴅᴇ ʀᴇsᴘᴜᴇsᴛᴀ ᴇs:`,
text3: `👑 ɴᴏᴠᴀʙᴏᴛ-ᴍᴅ | ᴀᴄᴛɪᴠᴏ ✅️:`, 
text4: `ᴘᴀʀᴀ ᴠᴇᴢ ᴍɪ ʟɪsᴛᴀ ᴅᴇ ᴄᴏᴍᴀɴᴅᴏ ᴜsᴀʀ #menu`, 
text5: `ɴᴏᴠᴀʙᴏᴛ ᴘᴏʀ ʟᴏʟɪʙᴏᴛ - sᴜʙsᴄʀɪʙɪʀᴛᴇ ᴇʟ ɴᴜᴇsᴛʀᴏ ᴄᴀɴᴀʟ ᴅᴇʟ ʏᴏᴜᴛᴜʙᴇ 🔔\nhttps://www.youtube.com/@elrebelde.21`, 
text6: `✅ Actividad:`, 
text7: `👥 Usuarios:` }

//antiarabe
const smsAntiFake = () => { return `✳️ في هذه المجموعة، لا يُسمح بأرقام مزيفة وسيؤدي ذلك إلى الطرد...` }
const smsAntiArabe = () => { return `✳️ في هذه المجموعة ، لا يُسمح باستخدام الأرقام العربية حتى الوقت القادم....` }

//allAntilink
const AntiLink = () => { return `*تم اكتشاف الرابط 📢*` }
const AntiLink2 = () => { return ` سوف تُزال من هذه المجموعة` }
const AntiLink3 = () => { return ` أنت مشرف المجموعة، لذا لن أمنعك من استخدام الروابط :)` }
const AntiLink4 = () => { return ` أنت تنقذ نفسك، أنا لست مسؤولاً، لا أستطيع حذفك` }
const AntiToxic = (m, isToxic) => { return ` يا @${m.sender.split('@')[0]} قل الكلمة*(${isToxic})* هذا محظور في هذه المجموعة، لا تكن سامًا  تحذير` }
const AntiToxic2 = () => { return ` لقد تجاوزت الإنذارات الأربعة ستتم إزالتك من هذه المجموعة 😐....` }
const viewOnce = () => { return ` هنا لا يُسمح بإخفاء أي شيء` }

//autosticker
const smsAutoSicker = () => { return `🤡 مرحبًا، من أين شاهدت ملصقًا يدوم طويلاً بهذا الشكل، غبي 🤣. (الحد الأقصى 15 ثانية)` }

//info
const nivel = () => { return `[ ❇️ ] يحتاج المستوى` }
const nivel2 = () => { return ` لاستخدام هذا الأمر، تحقق من مستواك الحالي بالأمر` }
const admin = () => { return `[❗] يمكن استخدام هذا الأمر فقط من قبل مسؤولي المجموعة` }
const botAdmin = () => { return `[❗] يمكن استخدام هذا الأمر فقط عندما يصبح الروبوت مسؤولاً` }
const propietario = () => { return `[❗] هذا الأمر مخصص فقط لصاحبي` }
const group = () => { return `[❗] هذا الأمر مخصص فقط للمجموعات` }
const private = () => { return `[❗] هذا الأمر يعمل فقط في محادثة خاصة بالروبوت.` }
const bot = () => { return `[❗] هذا الأمر يتم استخدامه فقط من قبل الروبوت` }
const error = () => { return `[❗] خطأ` }
const registra = () => { return `「 أنت غير مسجل」\n\n أنت لا تظهر في قاعدة بياناتي ✋🥸🤚\n\nلتتمكن من استخدامي ، اكتب الأمر التالي\n\nالأمر: /reg Nombre.edad` }
const limit = () => { return `*InyCoins استخدام*` }
const endLimit = () => { return `*😢 البقاء بدون مال*\n\n> *يمكنك استخدام الأمر #claim للحصول على المزيد InyCoins*` }
const exito = () => { return `*ناجح ✅*` }
const result = () => { return `*نتائج :*` }

const sms = {
text: ` مثال:`, 
text1: ` عنوان`, 
text2: ` الآراء`, 
text3: ` مدة`, 
text4: ` تم الرفع`, 
text5: ` وصف`, 
text6: ` لا تسأل عن السخف`, 
text7: ` أدخل طلبًا أو أمرًا لاستخدام وظيفة الدردشة (الذكاء الاصطناعي)\n• مثال:`, 
text8: `🚀 سرعة`, 
text9: `\`✅ معلومات الروبوت\``, 
text10: ` نشاط`, 
text11: ` المجموعات المحظورة`, 
text12: ` المستخدمين المحظورين`, 
text13: ` إجمالي المستخدمين`, 
text14: `\`💻 معلومات الخادم\``, 
text15: ` كبش`, 
text16: ` المنصات`, 
text17: ` الخادم`, 
text18: ` استخدام وحدة المعالجة المركزية`, 
text19: ` الذاكرة الاجمالية`, 
text20: `\`❐ استخدام ذاكرة NodeJS\``, 
text21: `\`❐ استخدام الوحدة المركزية الكلي\``, 
text22: `⚠️ اكتب قاعدة المجموعة`, 
text23: `*تم تحريف الإجراء*\n\n*استخدمه بهذه الطريقة*:*`, 
text24: `*نجح في فتح المجموعة بنجاح*✅*`, 
text25: `*تم إغلاق المجموعة بنجاح*✅*`, 
text26: `⚠️ أدخل النص`, 
text27: `⚠️ والصورة؟`, 
text28: `*مرحبا، أنت مسجل بالفعل🤓*`, 
text29: `*غير صحيح ❎*\n\n> أمر التسجيل هو\n> يأمر:`, 
text30: ` يفحص`, 
text31: ` اسم`, 
text32: ` عمر`, 
text33: ` تاريخ`, 
text34: ` رقم`, 
text35: `*💬 اختر لغتك: *`, 
text36: `*🕕 لقد استخدمت هذا الأمر بالفعل. عد لاحقًا:*`, 
text37: `⚠️ إجراء يساء استخدامه`, 
text38: (command) => `❬ 🚩 ❭ الوظيفة ${command} تم تمكينه في هذه المجموعة`, 
text39: (command) => `❬ 🚩 ❭ الوظيفة ${command} هذا مُعَطَّل في هذه المجموعة`, 
text40: ` تنبيه لجميع الأعضاء النشطين في هذه المجموعة 📣\n\nالرابط محظور\n\nوسيكون فقط للمشرفين في هذه المجموعة القدرة على مشاركة الرابط\n\nإذا قام أي مشارك غير مشرف بإرسال رابط من هذه المجموعة أو مجموعة أخرى، فسيتم طرده على الفور من هذه المجموعة` }

const idioma = (prefix) => { return `*✳️ ليستخدم:*\n${prefix}idioma 1 ( الأسبانية)\n${prefix}idioma 2 ( إنجليزي)\n${prefix}idioma 3 ( عرب)\n${prefix}idioma 4 ( إندونيسيا)\n${prefix}idioma 5 ( البرتغالية)\n${prefix}idioma 6 (ruso)\n\n*❗ مثال :*\n• ${prefix}idioma 1` }
const idioma2 = () => { return `✅ تم تغيير اللغة بنجاح إلى ` }

const info = {
text: ` تاريخ`, 
text1: ` نشاط`, 
text2: ` سرعة`, 
text3: ` طريق`, 
text4: ` بادئة`, 
text5: ` المستخدم المسجل`, 
text6: ` إجمالي المستخدمين`, 
text7: `* قم بتنشيط روبوتك النشط على مدار الساعة 24/7 على 𝘐𝘕𝘍𝘐𝘕𝘐𝘛𝘠-𝘏𝘖𝘚𝘛:*`, 
text8: `*روبوت بسيط مع عدد قليل من الأوامر**`, 
text9: `|- *_-¿ سؤال / شكوك?-_*`, 
text10: `||- *_- معلومة-_*`, 
text11: `*🚩 الأسعار : * 
 * 1 جيجابايت، 100 وحدة معالجة مركزية = 1 دولار
 * 2 جيجابايت، 120 وحدة معالجة مركزية = 2 دولار
 * 3 جيجابايت، 140 وحدة معالجة مركزية = 3 دولار
 * 4 جيجابايت، 175 وحدة معالجة مركزية = 4 دولار
 * 5 جيجابايت، 200 وحدة معالجة مركزية = 5 دولار`, 
text12: `*طريقة الدفع: *

*• باي بال :* paypal.me/OfcGB (🌎) 
*• سوق الدفع, الاسم المستعار:* OficialGB (🇦🇷🇵🇪🇺🇾🇲🇽🇨🇴🇧🇷🇨🇱) 
*• برتقالي ×, الاسم المستعار:* OficialGL (🇦🇷) 
*• يابي (بيرو) :*  51948705559 (🇵🇪) 
*• نيكي (كولومبيا)*  573027866596 (🇨🇴) 
*• بطاطا:* thelolibotm.uala (🇦🇷🇲🇽🇨🇴) 
*• $App:* $oficialgb (🇫🇰🇱🇷🇲🇽🇨🇴) 

*• الرابط المدفوع:* link.mercadopago.com.ar/h0sting 
*• باتريون:* https://patreon.com/Infinity_wa_hosting
*• كوفي:* https://ko-fi.com/infinitywa
*• أنا أدفع فقط بالبطاقة.* wa.me/390684003755`, 
text13: `*🚩 الرجاء إدخال تقريرك أو مشكلتك بحيث يمكن للمشرف مساعدتك*`, 
text14: `*✅ تم إرسال تقاريرك إلى مشرفي المضيف، سيتصلون بك في أقرب وقت ممكن.*`, 
text15: `👑 خالقي هو`, 
text16: `🚩 موظف استضافة الموقع`, 
text17: `*تواصل معهم إذا كنت بحاجة إلى مساعدة أو لديك أي استفسار. يرجى تجنب المزعجين، حيث قد يقومون بحظرك. 😉*`, 
}

module.exports = { console, tmp, smscall, smscall2, smsAntiPv, smsConexion, smsEscaneaQR, smsConectado, smsConexionOFF, smsConexioncerrar, smsConexionperdida, smsConexionreem, smsConexionreinicio, smsConexiontiem, smsConexiondescon, smsAvisos, smsAvisos2, smsAvisos3, smsAvisos4, smsAvisos5, smsAvisos6, smsAvisos7, smsAvisos8, smsAvisos9, smsWel, smsWel2, smsBye, promote, demote, consola, Bio, smsAntiFake, smsAntiArabe, smsAutoSicker, nivel, nivel2, admin, botAdmin, propietario, group, private, bot, error, registra, limit, endLimit, exito, result, sms, idioma, idioma2, info}
